upload/app/Models/ModuleModel.php

SELECT *
FROM `modules`
---
    public function getModules()
    {
        $builder = $this->builder($this->table);
        $builder = $builder->get();