upload/app/Models/RoleModel.php

    public function getInfo($id)
    {
        $builder = $this->builder($this->table);
        $builder = $builder->where('id', $id);
        $builder = $builder->get();
---
SELECT *
FROM `roles`
WHERE `id` = '1'