upload/app/Models/SettingModel.php

    public function getInfo()
    {
        $builder = $this->builder($this->table);
        $builder = $builder->where('id', 1);
        $builder = $builder->get();
---
SELECT *
FROM `settings`
WHERE `id` = 1