upload/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
    public function getInfo($id)
    {
        $builder = $this->builder($this->table);
        $builder = $builder->where('id', $id);
        $builder = $builder->get();

SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 7
---
    public function newUsers()
    {
        $builder = $this->builder($this->table);
        $builder = $builder->orderBy('id DESC');
        $builder = $builder->get(7);