upload/app/Modules/Admin/Users/Controllers/Users.php

    public function index()
    {
        $page  = '\users';
        $model = model(UserModel::class);
        $data  = [
            'page'     => $page,
            'model'    => $model,
            'paginate' => $model->orderBy('id', 'DESC')->paginate(14),
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 14
SELECT COUNT(*) AS `numrows`
FROM `users`