upload/app/Controllers/Admin.php

    public function modules()
    {
        $page  = 'modules';
        $model = model(ModuleModel::class);
        $data  = [
            'page'     => $page,
            'model'    => $model,
            'paginate' => $model->paginate(),
---
SELECT *
FROM `modules`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `modules`

    public function signin_post()
    {
        helper(['form']);

        if ($this->request->getMethod(true) == 'POST')
        {
            $post     = $this->request->getPost();
            $email    = isset($post['email']) ? $post['email'] : '';
            $password = isset($post['password']) ? $post['password'] : '';

            $model    = model(UserModel::class);
            $data     = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'alizairov@mail.ru'
 LIMIT 1