<?php

return [
    // App
    'language'    => 'Язык',
    'en'          => 'Английский',
    'ru'          => 'Русский',
    'tr'          => 'Турецкий',
    'az'          => 'Азербайджанский',

    'email'       => 'Эл. адрес',
    'password'    => 'Пароль',
    'forgot'      => 'Забыл пароль',
    'name'        => 'Имя',
    'surname'     => 'Фамилия',
    'admin'       => 'Администратор',
    'manager'     => 'Управляющий делами',
    'user'        => 'Пользователь',
    'urepair'     => 'В ремонте',
    'urepair_m'   => 'Сервис недоступен',

    // Messages
    'signin_m1'   => 'Добро пожаловать обратно! Пожалуйста, войдите, чтобы продолжить.',
    'signin_m2'   => 'Забыл пароль?',
    'signin_m3'   => 'У вас нет аккаунта?',
    'signin_m4'   => 'Завести аккаунт',
    'signin_m5'   => 'Электронная почта не существует.',
    'signin_m6'   => 'Неверный пароль.',
    'signin_m7'   => 'Вы не авторизованы для входа',

    'signup_m1'   => 'Создать новый аккаунт',
    'signup_m2'   => 'Зарегистрироваться',
    'signup_m3'   => 'У вас уже есть аккаунт?',
    'signup_m4'   => 'Регистрация успешно завершена. Пожалуйста войдите.',
    'signup_m5'   => 'Произошла ошибка во время регистрации.',

    'm_info'      => 'Информация',
    'm_success'   => 'Успех',
    'm_warning'   => 'Предупреждение',
    'm_error'     => 'Ошибка',
    
    // Admin
    'signin'      => 'Войти',
    'signup'      => 'Подписаться',
    'home'        => 'Дом',
    'profile'     => 'Профиль',
    'system'      => 'Система',
    'modules'     => 'Модули',
    'role'        => 'Роль',
    'path'        => 'Путь',
    'status'      => 'Включить',
    'blocked'     => 'Блокировать',
    'enabled'     => 'Включено',
    'disabled'    => 'Отключить',
    'yes'         => 'Да',
    'no'          => 'Нет',
    'logout'      => 'Выйти'
];